Revit 2024 API
EnergyDataSettings.CheckGroundPlane Method (Document, ElementId)
 The ground plane should be an Element of type Level. This method checks to confirm that an ElementId is for a Level element.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public static bool CheckGroundPlane(
	Document ccda,
	ElementId groundPlaneId
)
Visual Basic
Public Shared Function CheckGroundPlane ( _
	ccda As Document, _
	groundPlaneId As ElementId _
) As Boolean
Visual C++
public:
static bool CheckGroundPlane(
	Document^ ccda,
	ElementId^ groundPlaneId
)
Parameters
ccda
Type: Autodesk.Revit.DB.Document
 The Document.
groundPlaneId
Type: Autodesk.Revit.DB.ElementId
 The element id to be checked to confirm that it is suitable to be a ground plane (i.e., that it is a level) or that it is invalidElementId. Setting ground plane with invalidElementId will lead to the ground plane being "reset".
Return Value
 True if the input element is a level or invalidElementId, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
EnergyDataSettings Class
CheckGroundPlane Overload
Autodesk.Revit.DB.Analysis Namespace